
text=['人头目眉鼻耳口牙舌心手足身一二三四五六七八九十马牛羊鱼虫鸟天日月云风雨雪雷电回木米果瓜禾苗森林石亭花草山叶竹水土方圆尖大小高长弓刀勺面豆气分半点出入里外开关多少上下弯直来去吃喝吐立坐走飞看问哭笑车门井伞包布皮书画灯光衣裙袜裤鞋帽毛巾工厂灭火灰尘家爷奶妈爸哥弟姐妹我你男女前后左右东西南北中'.encode('utf-8').decode('utf-8'),'宋郑李徐刘陈吴郭赵胡章婆伯叔姨阿视迷球国京兴空发脸孔眼睛朵齿嘴巴双脚腿铃正腰好您请茶给孩儿们和不见喊纱回今午读题图线圈号课骑钓枪汤肉芽冬柿条饭铺玉莓苹糕床他她是就辆张盏件块本个颗只支服红黄黑绿蓝围色生窗未袋偶爱剪箱角台背机器吸汽炮箭兵类极滑冷痰向现很羽过亮乌打刮滴把闪路进退底青蛙这桥子树河地麦消害许房做盆片竿短坡散边蛋要用太阳的真更溪碧鲜艳早晨旁在美丽燕有还'.encode('utf-8').decode('utf-8')]

import sys
print(sys.stdin.encoding)
print(sys.stdout.encoding)
text1='人头目眉鼻耳口牙舌心手'.encode('utf-8').decode('utf-8')
print(text1)
