# 原始文字，不可修改  
text=['人头目眉鼻耳口牙舌心手足身一二三四五六七八九十马牛羊鱼虫鸟天日月云风雨雪雷电回木米果瓜禾苗森林石亭花草山叶竹水土方圆尖大小高长弓刀勺面豆气分半点出入里外开关多少上下弯直来去吃喝吐立坐走飞看问哭笑车门井伞包布皮书画灯光衣裙袜裤鞋帽毛巾工厂灭火灰尘家爷奶妈爸哥弟姐妹我你男女前后左右东西南北中','宋郑李徐刘陈吴郭赵胡章婆伯叔姨阿视迷球国京兴空发脸孔眼睛朵齿嘴巴双脚腿铃正腰好您请茶给孩儿们和不见喊纱回今午读题图线圈号课骑钓枪汤肉芽冬柿条饭铺玉莓苹糕床他她是就辆张盏件块本个颗只支服红黄黑绿蓝围色生窗未袋偶爱剪箱角台背机器吸汽炮箭兵类极滑冷痰向现很羽过亮乌打刮滴把闪路进退底青蛙这桥子树河地麦消害许房做盆片竿短坡散边蛋要用太阳的真更溪碧鲜艳早晨旁在美丽燕有还','白枝了样院久没班级借加识算魔木讲完成拿着老师事故听懂趣得觉起始专朋友象踢庭亲能够游泳盼望跑步蹦跳唱歌活泼快乐那些像什么怎病都想学校排队穿旗升城广播星送礼敬最响声祖说到瞧也菜额卷紧唇饱同岁拖饿擦汗帮助干净明聪夸奖自己年龄卡贺彩虹慢岭荷变化蝴蝶舞蹈梦乡吞湖颜再洗谁呢比赛对市节季春夏秋枯笔烈遮挡撑落降秘密取暖泥堆从滚玻璃常非鸭等于带斤江终猫爪买尺捉虾猴戏作业渴捡纸童呀哎瓦裝船划放轻松挂钩睛朗间时候岸可以感谢喜欢两群尾兔养怕狗猎咬萝卜喂猪惊慌每次屋为因公主其它运动激选择微如熊加参刺猬辣椒填晩傍漂流哪棵迎接粗细桃核泪种结束摘梨错会拉差话力抓此苦新闻行粮食瓶罐血管丢失假期脑千万集合','雀收藏铅拍姑娘玩具踩坏配壳贝抱鹅简单厨满影积搭谎眨柳杨攻蚊位让躺椅奇怪蜜蜂蜻蜓缺标几页睡桌珍珠扔休息愿意报阴较观众永远超姓名冠军金牌抄写教室体操场伸臂曲锻炼坚持句越互相座钟拳确深浅挺跟踪拦住顶峰矮希帘香烟清楚舒急忙暗耀寒街道棉袄告诉近处虎王植物勇敢已经刚才强壮钻洞攀登卖户飘洒商店捏娃粘贴宝贵元旦答案泡熱悉昨夜吵架规则全骂鸦办法悬崖棋幼鹿伙伴跌倒救命狐狸鸣叫连臭悄巧妙胜利寻拢母鸡妖鬼凶恶杀敌脱掉冲垮野兽斑纹重量推翻战士使劲讨厌追赶斜爬低部挣扎毒理叠邻居辈而且并列庆祝梳辫招待端碗捧舰艇杯盖炒栗煮饺团聚烧饼思念呼沙漠保护阵距离困难容昜海滩无聊周站岗危险壸糟卫建设环境污染塑料搬貌鸥趴披匹坪梢哨拾尝闭掰丑导丁冻蹲帆','整齐池塘蝌蚪蚯蚓蚂蚁被窝捕捞鸽笼罩平衡稳当原谅醉枣项链交叉转移锹挖坑砸缸受伤首先射击称赞英雄鼠诵猜谜租司令任务药药膏医治疗照顾胸闷弹味精往返砖墙斗争展另遇皱劳累价格酒吧武艺准备餐厅蘑菇压扁虽然形状产品采访甘甜介绍瞎除夕党员醒淘鞠躬托盘联系应该顽哔啦忽略健康奔渔网桶钱柜朝霞胖瘦引悔输贏湿透继续热闹议论撕破敲鼓特别灵敏摔碎拥挤停顿优秀代替顺序宣传掌握即将遗留割断票投篮忆普通制造按怀疑组凉爽晾晒扫帚施肥浇灌唐古诗科技旅馆茂盛腊梅喷泉蜘蛛拔剑领楼层乘融描词语翅膀懒惰抬轿邮局烦恼秒表暴露雕刻针盒随便剩余驾驶艘速逃挑铜文惜席杏兄仿丰佛父各根共汉夹','剧痛批评摆弄严肃扶梯检查肚肠承认修改闯祸诚实练嗓肯定恳求温度估计零沉浮棍棒催眠纺织秤杆习惯丝钢柱情况指挥演奏鞭躲避内村庄震聋吓碰撞突袭邀淹死抢夺善良必需寄信冒充含糖农民封存坦克摇晃调换警察忧愁拒绝贡献付款颤抖孤独忘记拼音牢固神仙垃圾漏由贫穷富翁隔壁皇帝宫殿灿烂辉煌筷培育缝补衬衫套幸福芝麻羡慕预约解决货轮愤怒宽肩娇嫩澡堂厕所拎恐龙派糊凃厚薄印折扇银锁轰隆挠痒败仗功夫偷摸甩绳仓库板凳官隐蔽忍耐闲谈跨栏捣乱硬币欺骗创举央瓣航模琴弦怨恨笨狼缩横竖淋浴狮吼禁止油漆爆炸筋骨龟蛇扮蒸须骄傲吹喇叭扑粉番茄考试安静世界拔镜旧锅堵塞迟枕景区临稻减数波浪宇宙免费反复增添苍蝇陪客冰雹柔软葡萄延郊晶砍靠矿兰莲埋蚜言雁秧洋饮映园栽睁值啄紫字总百']
print(text)
# 每册字数
num_page=[144,180,288,306,270,312]

fndstr=input('输入查找汉字，可以多字输入：\n')


for fnd in fndstr:
    print('-------------------')
    print( fnd)
    n=0
    total_order=0
    
    while n<6:  #0-5册
        #print(text[n])
        pos=text[n].find(fnd)+1
        if pos>0:
            print('本 序 总序')
            #本册序号
            order=text[n].find(fnd)+1 #本册序号
            #总序号
            total_order=total_order+order
            
            print( n+1,order,total_order)
            if total_order<501:
                print('序号500以内在一期买的卡片找')
            break
        
        total_order=total_order+num_page[n]
        n=n+1





##import sys
##print(sys.stdin.encoding)
##print(sys.stdout.encoding)
##text1='人头目眉鼻耳口牙舌心手'.encode('utf-8').decode('utf-8')
##print(text1)
# 原始文字，不可修改  # 每册字数
